#!/usr/bin/env python3
# -*- coding: utf-8 -*-

help_msg = {
    'staff': '''<b>Как я работаю???</b>
Все просто, уверен мы быстро подружимся!!! 

<b>У меня несколько кнопок:</b>
<b>✅ Открыть смену</b> - <i>начало смены;</i>
<b>🏠 На базе</b> - <i>нажмите, если вы вернулись с полного марштрута;</i>
<b>⏳ Позиция в очереди</b> - <i>узнать вашу позицию в очереди;</i>
<b>⚡ После ЭКС/МОЛ</b> - <i>нажмите, если вы вернулись с Экспресс/Молнии;</i>     
<b>🚗 Отъехать</b> - <i>нажмите, если вам нужно отлучиться (мойка, шинка, магазин, обед, прочее), выберите один из вариантов.
Вернуться в очередь <b>🏠 На базе</b>;</i> 
<b>❌ Закрыть смену</b> - <i>закрывает текущую смену.</i>   

Писать в чат "Иванов на базе" Больше не нужно.
Если остались вопросы, подойдите к Логисту/Супервайзеру.

<b>Доступно через команды:</b>
 /start - запуск бота (если меню потеряется);
 /myid - твой Telegram id;
 /help - как я работаю.''',

    'logist': '''
<b>Как я работаю???</b>
Все просто, уверен мы быстро подружимся!!! 

<b>У меня несколько кнопок:</b>
<b>Очередь</b> - <i>полчучить список сотрудников в очереди;</i>

<b>Доступно через команды:</b>
 /start - запуск бота (если меню потеряется);
 /myid - твой Telegram id;
 /help - как я работаю.''',

    'boss': '''<b>Как я работаю???</b>
Все просто, уверен мы быстро подружимся!!! 

<b>У меня несколько кнопок:</b>
<b>Очередь</b> - <i>полчучить список сотрудников в очереди;</i>
<b>Обновить</b> - <i>измнить должность сотрудника (логист или курьер);</i>
<b>Активировать</b> - <i>сделать сотрдника активным (если его не активировали);</i>
<b>Удалить</b> - <i>удалить сотрудника.</i>

<b>Доступно через команды:</b>
 /start - запуск бота (если меню потеряется);
 /myid - твой Telegram id;
 /help - как я работаю;
 /cancel - отменить текщее действие.'''
}
